<center>
<img src="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-RP0321EN-SkillsNetwork/labs/module_1/images/SN_web_lightmode.png" width="300"> 
</center>

# Assignment: Exploratory Data Analysis with SQL
Estimated time needed: 60 minutes


# Introduction
Using this R notebook you will perform exploratory data analysis using SQL queries with the RSQLite R package. You will be graded on the accuracy of your results as well as the content of your SQL queries.

### Establish your SQL Lite connection

#### Install RSQLite package
The RSQlite  package needs to be installed in your notebook. Let’s load the RSQLite package by clicking on the following cell and executing it (Shift+Enter):

In [1]:
install.packages("https://cran.r-project.org/src/contrib/Archive/RSQLite/RSQLite_0.10.0.tar.gz", repos = NULL, type = "source", dependencies = TRUE)

#### Restart Kernel

After installing the RSQLite package, it is necessary to restart R Kernel. Click **Kernel** > **Restart Kernel** from the main menu. This will register the newly installed packages. Now proceed to load the RSQLite package.

#### Load RSQLite
Load the 'RSQLite' library, and use the 'dbConnect( )' function as you did in the previous labs to establish the connection to your SQLite database.  
You are now ready to start running SQL queries using the RSQLite library as you did in Course 3.

In [1]:
library("RSQLite")
library(tidyverse)

Loading required package: DBI
── Attaching packages ─────────────────────────────────────── tidyverse 1.3.0 ──
✔ ggplot2 3.3.0     ✔ purrr   0.3.4
✔ tibble  3.0.1     ✔ dplyr   0.8.5
✔ tidyr   1.0.2     ✔ stringr 1.4.0
✔ readr   1.3.1     ✔ forcats 0.5.0
── Conflicts ────────────────────────────────────────── tidyverse_conflicts() ──
✖ dplyr::filter() masks stats::filter()
✖ dplyr::lag()    masks stats::lag()

In [2]:
# provide your solution here to connect db
con <- dbConnect(RSQLite::SQLite(), "MyDB")

df1 <- dbExecute(con, "CREATE TABLE SEOUL_BIKE_SHARING(
                            DATE DATE NOT NULL,
                            RENTED_BIKE_COUNT INTEGER NOT NULL,
                            HOUR INTEGER NOT NULL,
                            TEMPERATURE FLOAT(6) NOT NULL,
                            HUMIDITY INTEGER NOT NULL,
                            WIND_SPEED FLOAT(6) NOT NULL,
                            VISIBILITY INTEGER NOT NULL,
                            DEW_POINT_TEMPERATURE FLOAT(6) NOT NULL,
                            SOLAR_RADIATION FLOAT(6) NOT NULL,
                            RAINFALL FLOAT(6) NOT NULL,
                            SNOWFALL FLOAT(6) NOT NULL,
                            SEASONS VARCHAR(20) NOT NULL,
                            HOLIDAY VARCHAR(20) NOT NULL,
                            FUNCTIONING_DAY VARCHAR(20) NOT NULL
                        )"
                    )
                 
df2 <- dbExecute(con, "CREATE TABLE CITIES_WEATHER_FORECAST(
                        CITY VARCHAR(20) NOT NULL,
                        WEATHER VARCHAR(20) NOT NULL,
                        VISIBILITY INTEGER NOT NULL,
                        TEMP FLOAT(6) NOT NULL,
                        TEMP_MIN FLOAT(6) NOT NULL,
                        TEMP_MAX FLOAT(6) NOT NULL,
                        PRESSURE INTEGER NOT NULL,
                        HUMIDITY INTEGER NOT NULL,
                        WIND_SPEED FLOAT(6) NOT NULL,
                        WIND_DEG INTEGER NOT NULL,
                        SEASON VARCHAR(20) NOT NULL,
                        FORECAST_DATETIME INTEGER NOT NULL
                        )"

                )

df3 <- dbExecute(con, "CREATE TABLE BIKE_SHARING_SYSTEMS(
                            COUNTRY VARCHAR(20) NOT NULL,
                            CITY VARCHAR(20) NOT NULL,
                            SYSTEM VARCHAR(20) NOT NULL,
                            BICYCLES VARCHAR(20) NOT NULL
                        )"
                )

df4 <- dbExecute(con, "CREATE TABLE WORLD_CITIES(
                            CITY VARCHAR(20) NOT NULL,
                            CITY_ASCII VARCHAR(20) NOT NULL,
                            LAT FLOAT(6) NOT NULL,
                            LNG FLOAT(6) NOT NULL,
                            COUNTRY VARCHAR(20) NOT NULL,
                            ISO2 VARCHAR(20) NOT NULL,
                            ISO3 VARCHAR(20) NOT NULL,
                            ADMIN_NAME VARCHAR(20) NOT NULL,
                            CAPITAL VARCHAR(20) NOT NULL,
                            POPULATION INTEGER NOT NULL,
                            ID VARCHAR(20) NOT NULL
                            )"
                )

ERROR: Error in sqliteExecStatement(conn, statement, ...): RS-DBI driver: (error in statement: table SEOUL_BIKE_SHARING already exists)

Download the following csv files:

*   [WORLD_CITIES](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-RP0321EN-SkillsNetwork/labs/datasets/world_cities.csv)

*   [BIKE_SHARING_SYSTEMS](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-RP0321EN-SkillsNetwork/labs/datasets/bike_sharing_systems.csv)

*   [CITIES_WEATHER_FORECAST](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-RP0321EN-SkillsNetwork/labs/datasets/cities_weather_forecast.csv)

*   [SEOUL_BIKE_SHARING](https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-RP0321EN-SkillsNetwork/labs/datasets/seoul_bike_sharing.csv)

and load the csv's  into 4 tables as mentioned below
* SEOUL_BIKE_SHARING

* CITIES_WEATHER_FORECAST

* BIKE_SHARING_SYSTEMS 

*  WORLD_CITIES

> Hint : Use the read_csv() function and dbWriteTable() functions


## Task 1 - Record Count
#### Determine how many records are in the seoul_bike_sharing dataset.

### Solution 1

In [14]:
# provide your solution here

seouldf <- read_csv("https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-RP0321EN-SkillsNetwork/labs/datasets/seoul_bike_sharing.csv")
citiesdf <- read_csv("https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-RP0321EN-SkillsNetwork/labs/datasets/cities_weather_forecast.csv")
bikedf <- read_csv("https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-RP0321EN-SkillsNetwork/labs/datasets/bike_sharing_systems.csv")
worlddf <- read_csv("https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-RP0321EN-SkillsNetwork/labs/datasets/world_cities.csv")

dbWriteTable(con, "SEOUL_BIKE_SHARING", seouldf, overwrite=TRUE, header=TRUE)
dbWriteTable(con, "CITIES_WEATHER_FORECAST", citiesdf, overwrite=TRUE, header=TRUE)
dbWriteTable(con, "BIKE_SHARING_SYSTEMS", bikedf, overwrite=TRUE, header=TRUE)
dbWriteTable(con, "WORLD_CITIES", worlddf, overwrite=TRUE, header=TRUE)
dbListTables(con)

Parsed with column specification:
cols(
  DATE = col_character(),
  RENTED_BIKE_COUNT = col_double(),
  HOUR = col_double(),
  TEMPERATURE = col_double(),
  HUMIDITY = col_double(),
  WIND_SPEED = col_double(),
  VISIBILITY = col_double(),
  DEW_POINT_TEMPERATURE = col_double(),
  SOLAR_RADIATION = col_double(),
  RAINFALL = col_double(),
  SNOWFALL = col_double(),
  SEASONS = col_character(),
  HOLIDAY = col_character(),
  FUNCTIONING_DAY = col_character()
)

[1] "BIKE_SHARING_SYSTEMS"    "CITIES_WEATHER_FORECAST"
[3] "SEOUL_BIKE_SHARING"      "WORLD_CITIES"

     DATE           RENTED_BIKE_COUNT      HOUR        TEMPERATURE
 Length:8465        Min.   :   2.0    Min.   : 0.00   Min.   :-17.80
 Class :character   1st Qu.: 214.0    1st Qu.: 6.00   1st Qu.:  3.00
 Mode  :character   Median : 542.0    Median :12.00   Median : 13.50
                    Mean   : 729.2    Mean   :11.51   Mean   : 12.77
                    3rd Qu.:1084.0    3rd Qu.:18.00   3rd Qu.: 22.70
                    Max.   :3556.0    Max.   :23.00   Max.   : 39.40
    HUMIDITY       WIND_SPEED      VISIBILITY   DEW_POINT_TEMPERATURE
 Min.   : 0.00   Min.   :0.000   Min.   :  27   Min.   :-30.600
 1st Qu.:42.00   1st Qu.:0.900   1st Qu.: 935   1st Qu.: -5.100
 Median :57.00   Median :1.500   Median :1690   Median :  4.700
 Mean   :58.15   Mean   :1.726   Mean   :1434   Mean   :  3.945
 3rd Qu.:74.00   3rd Qu.:2.300   3rd Qu.:2000   3rd Qu.: 15.200
 Max.   :98.00   Max.   :7.400   Max.   :2000   Max.   : 27.200
 SOLAR_RADIATION     RAINFALL          SNOWFALL         SEASONS
 Min.   :0.0000   Min.   : 0.0000   Min.   :0.00000   Length:8465
 1st Qu.:0.0000   1st Qu.: 0.0000   1st Qu.:0.00000   Class :character
 Median :0.0100   Median : 0.0000   Median :0.00000   Mode  :character
 Mean   :0.5679   Mean   : 0.1491   Mean   :0.07769
 3rd Qu.:0.9300   3rd Qu.: 0.0000   3rd Qu.:0.00000
 Max.   :3.5200   Max.   :35.0000   Max.   :8.80000
   HOLIDAY          FUNCTIONING_DAY
 Length:8465        Length:8465
 Class :character   Class :character
 Mode  :character   Mode  :character

In [3]:
dbGetQuery(con, 'SELECT COUNT(*) FROM SEOUL_BIKE_SHARING')

  COUNT(*)
1 8465

## Task 2 - Operational Hours
#### Determine how many hours had non-zero rented bike count.

### Solution 2

In [4]:
# provide your solution here
dbGetQuery(con, 'select count(HOUR) from SEOUL_BIKE_SHARING
                where HOUR > 0')

  count(HOUR)
1 8113

## Task 3 - Weather Outlook
#### Query the the weather forecast for Seoul over the next 3 hours.
Recall that the records in the CITIES_WEATHER_FORECAST dataset are 3 hours apart, so we just need the first record from the query.

### Solution 3

In [5]:
# provide your solution here
dbGetQuery(con, 'select * from CITIES_WEATHER_FORECAST
                    where CITY = "Seoul"
                    LIMIT 1')

  row_names CITY  WEATHER VISIBILITY TEMP  TEMP_MIN TEMP_MAX PRESSURE HUMIDITY
1 1         Seoul Clear   10000      12.32 10.91    12.32    1015     50
  WIND_SPEED WIND_DEG SEASON FORECAST_DATETIME
1 2.18       248      Spring 1618574400.0

## Task 4 - Seasons
#### Find which seasons are included in the seoul bike sharing dataset.

### Solution 4

In [6]:
# provide your solution here
dbGetQuery(con, 'select distinct SEASONS FROM SEOUL_BIKE_SHARING')

  SEASONS
1 Winter
2 Spring
3 Summer
4 Autumn

## Task 5 - Date Range
#### Find the first and last dates in the Seoul Bike Sharing dataset.

### Solution 5

In [8]:
# provide your solution here
#dbGetQuery(con, 'select DATE from SEOUL_BIKE_SHARING limit 10')
dbGetQuery(con, 'SELECT STRFTIME("%d/%m/%Y", "DATE") AS formated_date FROM SEOUL_BIKE_SHARING GROUP BY DATE')
#dbGetQuery(con, 'select try_cast(DATE as date) from SEOUL_BIKE_SHARING limit 5')

    formated_date
1   NA
2   NA
3   NA
4   NA
5   NA
6   NA
7   NA
8   NA
9   NA
10  NA
11  NA
12  NA
13  NA
14  NA
15  NA
16  NA
17  NA
18  NA
19  NA
20  NA
21  NA
22  NA
23  NA
24  NA
25  NA
26  NA
27  NA
28  NA
29  NA
30  NA
⋮   ⋮
324 NA
325 NA
326 NA
327 NA
328 NA
329 NA
330 NA
331 NA
332 NA
333 NA
334 NA
335 NA
336 NA
337 NA
338 NA
339 NA
340 NA
341 NA
342 NA
343 NA
344 NA
345 NA
346 NA
347 NA
348 NA
349 NA
350 NA
351 NA
352 NA
353 NA

## Task 6 - Subquery - 'all-time high'
#### determine which date and hour had the most bike rentals.

### Solution 6

In [ ]:
# provide your solution here
dbGetQuery(con, 'select

## Task 7 - Hourly popularity and temperature by season
#### Determine the average hourly temperature and the average number of bike rentals per hour over each season. List the top ten results by average bike count.

### Solution 7

In [ ]:
# provide your solution here

## Task 8 - Rental Seasonality
#### Find the average hourly bike count during each season. 
Also include the minimum, maximum, and standard deviation of the hourly bike count for each season. 

> Hint : Use the SQRT(AVG(col*col) - AVG(col)*AVG(col) ) function where col refers to your column name for finding the standard deviation

### Solution 8

In [ ]:
# provide your solution here

Let's explore a bit and see what might be the most significant contributing factors in terms of the provided data.

## Task 9 - Weather Seasonality
#### Consider the weather over each season. On average, what were the TEMPERATURE, HUMIDITY, WIND_SPEED, VISIBILITY, DEW_POINT_TEMPERATURE, SOLAR_RADIATION, RAINFALL, and SNOWFALL per season?
Include the average bike count as well , and rank the results by average bike count so you can see if it is correlated with the weather at all.

### Solution 9

In [ ]:
# provide your solution here

## Task 10 - Total Bike Count and City Info for Seoul
#### Use an implicit join across the WORLD_CITIES and the BIKE_SHARING_SYSTEMS tables to determine the total number of bikes avaialble in Seoul, plus the following city information about Seoul: CITY, COUNTRY, LAT, LON, POPULATION, in a single view.
Notice that in this case, the CITY column will work for the WORLD_CITIES table, but in general you would have to use the CITY_ASCII column.

### Solution 10

In [ ]:
# provide your solution here

## Task 11 - Find all city names and coordinates with comparable bike scale to Seoul's bike sharing system
#### Find all cities with total bike counts between 15000 and 20000. Return the city and country names, plus the coordinates (LAT, LNG), population, and number of bicycles for each city.
Later we will ask you to visualize these similar cities on leaflet, with some weather data.

### Solution 11

In [ ]:
# provide your solution here

In [ ]:
close(conn)

## Author(s)

<h4> Jeff Grossman </h4>
<h4> Lakshmi Holla </h4>


## Other Contributor(s)

<h4>  Malika Singla </h4>

<!--## Change log

| Date (YYYY-MM-DD) | Version | Changed By | Change Description                 |
| ----------------- | ------- | ---------- | ---------------------------------- |
| 2022-03-03        | 1.0     |Lakshmi Holla  | Created lab using sqlite3          |-->

## <h3 align="center"> © IBM Corporation 2022. All rights reserved. <h3/>